gh-pages/module-docs/couch_btree.org
#+TITLE:     couch\_btree
#+AUTHOR:    Robert Dionne
#+EMAIL:     bitdiddle@apache.org
#+DATE:      2011-12-19 Mon
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
** Overview
CouchDB btree is not a btree in the classical
[[http://en.wikipedia.org/wiki/B-tree#Technical_description][sense]] of having
an order and maintaining lower and upper bounds on the number of nodes
at each level, but this is due to the append only nature of couchdb
and the MVCC model. In place updates are not performed so you won't
see the usual splitting and merging of nodes. Whenever a leaf node is
updated the entire path from the leaf to the root is also written
anew. However it is certainly a btree in providing log access and the
use of branching at each level to minimize the amount of disk
access. It's more or less self-balancing in the way an initial btree
might be populated by establishing a chunk size that determines how
many keys are packed into each chunk and letting that drive the
branching as branches are built up from the bottom (.eg. see [[http://en.wikipedia.org/wiki/Introduction_to_Algorithms][Cormen
and Rivest]] for an algorithm like this). It also stores information
(data sizes, deletes, and reductions) in the interior nodes. [[http://en.wikipedia.org/wiki/Donald_Knuth][Knuth,
Volume 3 Sorting and Searching]] is arguably a definitive reference. The
[[http://guide.couchdb.org/draft/btree.html][couchdb]] reference book also has a brief discussion of it's
use of btrees.

One of the real elegant pieces in this module is the recursive nature
of [[#query_modify][query\_modify]] which handles lookups, inserts, and deletes whilst
walking down the tree.

