gh-pages/module-docs/couch_btree.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>couch_btree</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-12-19 Mon"/>
<meta name="author" content="Robert Dionne"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">couch_btree</h1>


<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Overview </h3>
<div class="outline-text-3" id="text-1">

<p>CouchDB btree is not a btree in the classical
<a href="http://en.wikipedia.org/wiki/B-tree#Technical_description">sense</a> of having
an order and maintaining lower and upper bounds on the number of nodes
at each level, but this is due to the append only nature of couchdb
and the MVCC model. In place updates are not performed so you won't
see the usual splitting and merging of nodes. Whenever a leaf node is
updated the entire path from the leaf to the root is also written
anew. However it is certainly a btree in providing log access and the
use of branching at each level to minimize the amount of disk
access. It's more or less self-balancing in the way an initial btree
might be populated by establishing a chunk size that determines how
many keys are packed into each chunk and letting that drive the
branching as branches are built up from the bottom (.eg. see <a href="http://en.wikipedia.org/wiki/Introduction_to_Algorithms">Cormen and Rivest</a> for an algorithm like this). It also stores information
(data sizes, deletes, and reductions) in the interior nodes. <a href="http://en.wikipedia.org/wiki/Donald_Knuth">Knuth, Volume 3 Sorting and Searching</a> is arguably a definitive reference. The
<a href="http://guide.couchdb.org/draft/btree.html">couchdb</a> reference book also has a brief discussion of it's
use of btrees.
</p>
<p>
One of the real elegant pieces in this module is the recursive nature
of <a href="#query_modify">query_modify</a> which handles lookups, inserts, and deletes whilst
walking down the tree.
</p>
</div>

</div>
