gh-pages/module-docs/couch_btree.org
** The Code

#+BEGIN_EXAMPLE

    -module(couch_btree).

    -export([open/2, open/3, query_modify/4, add/2, add_remove/3]).
    -export([fold/4, full_reduce/1, final_reduce/2, size/1, foldl/3, foldl/4]).
    -export([fold_reduce/4, lookup/2, get_state/1, set_options/2]).
    -export([less/3]).

    -include("couch_db.hrl").
    -define(CHUNK_THRESHOLD, 16#4ff).

#+END_EXAMPLE

Extract and Assemble tranform various erlang structures to and from
key-value pairs, .eg. [[https://github.com/bdionne/couchdb/blob/couch-docs/src/couchdb/couch_db_updater.erl#L325][btree\_by\_id\_split]] and [[https://github.com/bdionne/couchdb/blob/couch-docs/src/couchdb/couch_db_updater.erl#L346][btree\_by\_id\_join]] are
one such pair of extract/assemble pairs used by in couch\_db\_updater
for the by\_id btree.

#+BEGIN_SRC erlang

    extract(#btree{extract_kv=Extract}, Value) ->
        Extract(Value).

    assemble(#btree{assemble_kv=Assemble}, Key, Value) ->
        Assemble(Key, Value).

    less(#btree{less=Less}, A, B) ->
        Less(A, B).

#+END_SRC
This version of open I believe is only used in testing
#+BEGIN_SRC erlang
    % pass in 'nil' for State if a new Btree.
    open(State, Fd) ->
        {ok, #btree{root=State, fd=Fd}}.
#+END_SRC

### Configuring the btree

Setting the options is a typical erlang function that recursively
walks a list, updating the btree record as it goes along until the
options list is empty.

#+BEGIN_SRC erlang

    set_options(Bt, []) ->
        Bt;
    set_options(Bt, [{split, Extract}|Rest]) ->
        set_options(Bt#btree{extract_kv=Extract}, Rest);
    set_options(Bt, [{join, Assemble}|Rest]) ->
        set_options(Bt#btree{assemble_kv=Assemble}, Rest);
    set_options(Bt, [{less, Less}|Rest]) ->
        set_options(Bt#btree{less=Less}, Rest);
    set_options(Bt, [{reduce, Reduce}|Rest]) ->
        set_options(Bt#btree{reduce=Reduce}, Rest);
    set_options(Bt, [{compression, Comp}|Rest]) ->
        set_options(Bt#btree{compression=Comp}, Rest).
#+END_SRC


When a btree is opened, for example in [[https://github.com/bdionne/couchdb/blob/couch-docs/src/couchdb/couch_db_updater.erl#L441][couch\_db\_updater]] a file
descriptor is passed along with a group of options. Note that in the
case of couch\_db\_updater, the names for the extract and assemble
functions have nothing to do with splits and joins as those names are
used in the literature. What these functions do is serialize and
deserialize the erlang records used to hold the documents. In this
case the by\_id btree uses full\_doc\_info records and the by\_seq
btree doc\_info records.

#+BEGIN_SRC erlang


    open(State, Fd, Options) ->
        {ok, set_options(#btree{root=State, fd=Fd}, Options)}.

    get_state(#btree{root=Root}) ->
        Root.

#+END_SRC

#+BEGIN_SRC erlang

    final_reduce(#btree{reduce=Reduce}, Val) ->
        final_reduce(Reduce, Val);
    final_reduce(Reduce, {[], []}) ->
        Reduce(reduce, []);
    final_reduce(_Bt, {[], [Red]}) ->
        Red;
    final_reduce(Reduce, {[], Reductions}) ->
        Reduce(rereduce, Reductions);
    final_reduce(Reduce, {KVs, Reductions}) ->
        Red = Reduce(reduce, KVs),
        final_reduce(Reduce, {[], [Red | Reductions]}).

#+END_SRC

#+BEGIN_SRC erlang


    fold_reduce(#btree{root=Root}=Bt, Fun, Acc, Options) ->
        Dir = couch_util:get_value(dir, Options, fwd),
        StartKey = couch_util:get_value(start_key, Options),
        EndKey = case couch_util:get_value(end_key_gt, Options) of
            undefined -> couch_util:get_value(end_key, Options);
            LastKey -> LastKey
        end,
        KeyGroupFun = couch_util:get_value(key_group_fun, Options, fun(_,_) -> true end),
        {StartKey2, EndKey2} =
        case Dir of
            rev -> {EndKey, StartKey};
            fwd -> {StartKey, EndKey}
        end,
        try
            {ok, Acc2, GroupedRedsAcc2, GroupedKVsAcc2, GroupedKey2} =
                reduce_stream_node(Bt, Dir, Root, StartKey2, EndKey2, undefined, [], [],
                KeyGroupFun, Fun, Acc),
            if GroupedKey2 == undefined ->
                {ok, Acc2};
            true ->
                case Fun(GroupedKey2, {GroupedKVsAcc2, GroupedRedsAcc2}, Acc2) of
                {ok, Acc3} -> {ok, Acc3};
                {stop, Acc3} -> {ok, Acc3}
                end
            end
        catch
            throw:{stop, AccDone} -> {ok, AccDone}
        end.

#+END_SRC

#+BEGIN_SRC erlang


    full_reduce(#btree{root=nil,reduce=Reduce}) ->
        {ok, Reduce(reduce, [])};
    full_reduce(#btree{root=Root}) ->
        {ok, element(2, Root)}.

#+END_SRC

#+BEGIN_SRC erlang

    size(#btree{root = nil}) ->
        0;
    size(#btree{root = {_P, _Red}}) ->
        % pre 1.2 format
        nil;
    size(#btree{root = {_P, _Red, Size}}) ->
        Size.

#+END_SRC

#+BEGIN_SRC erlang

    % wraps a 2 arity function with the proper 3 arity function
    convert_fun_arity(Fun) when is_function(Fun, 2) ->
        fun
            (visit, KV, _Reds, AccIn) -> Fun(KV, AccIn);
            (traverse, _K, _Red, AccIn) -> {ok, AccIn}
        end;
    convert_fun_arity(Fun) when is_function(Fun, 3) ->
        fun
            (visit, KV, Reds, AccIn) -> Fun(KV, Reds, AccIn);
            (traverse, _K, _Red, AccIn) -> {ok, AccIn}
        end;
    convert_fun_arity(Fun) when is_function(Fun, 4) ->
        Fun.    % Already arity 4

#+END_SRC

#+BEGIN_SRC erlang

    make_key_in_end_range_function(#btree{less=Less}, fwd, Options) ->
        case couch_util:get_value(end_key_gt, Options) of
        undefined ->
            case couch_util:get_value(end_key, Options) of
            undefined ->
                fun(_Key) -> true end;
            LastKey ->
                fun(Key) -> not Less(LastKey, Key) end
            end;
        EndKey ->
            fun(Key) -> Less(Key, EndKey) end
        end;
    make_key_in_end_range_function(#btree{less=Less}, rev, Options) ->
        case couch_util:get_value(end_key_gt, Options) of
        undefined ->
            case couch_util:get_value(end_key, Options) of
            undefined ->
                fun(_Key) -> true end;
            LastKey ->
                fun(Key) -> not Less(Key, LastKey) end
            end;
        EndKey ->
            fun(Key) -> Less(EndKey, Key) end
        end.

#+END_SRC

#+BEGIN_SRC erlang


    foldl(Bt, Fun, Acc) ->
        fold(Bt, Fun, Acc, []).

    foldl(Bt, Fun, Acc, Options) ->
        fold(Bt, Fun, Acc, Options).


    fold(#btree{root=nil}, _Fun, Acc, _Options) ->
        {ok, {[], []}, Acc};
    fold(#btree{root=Root}=Bt, Fun, Acc, Options) ->
        Dir = couch_util:get_value(dir, Options, fwd),
        InRange = make_key_in_end_range_function(Bt, Dir, Options),
        Result =
        case couch_util:get_value(start_key, Options) of
        undefined ->
            stream_node(Bt, [], Bt#btree.root, InRange, Dir,
                    convert_fun_arity(Fun), Acc);
        StartKey ->
            stream_node(Bt, [], Bt#btree.root, StartKey, InRange, Dir,
                    convert_fun_arity(Fun), Acc)
        end,
        case Result of
        {ok, Acc2}->
            FullReduction = element(2, Root),
            {ok, {[], [FullReduction]}, Acc2};
        {stop, LastReduction, Acc2} ->
            {ok, LastReduction, Acc2}
        end.

#+END_SRC

