gh-pages/module-docs/couch_btree.html

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">The Code </h3>
<div class="outline-text-3" id="text-2">





<pre class="example">
-module(couch_btree).

-export([open/2, open/3, query_modify/4, add/2, add_remove/3]).
-export([fold/4, full_reduce/1, final_reduce/2, size/1, foldl/3, foldl/4]).
-export([fold_reduce/4, lookup/2, get_state/1, set_options/2]).
-export([less/3]).

-include("couch_db.hrl").
-define(CHUNK_THRESHOLD, 16#4ff).

</pre>




<p>
Extract and Assemble tranform various erlang structures to and from
key-value pairs, .eg. <a href="https://github.com/bdionne/couchdb/blob/couch-docs/src/couchdb/couch_db_updater.erl#L325">btree_by_id_split</a> and <a href="https://github.com/bdionne/couchdb/blob/couch-docs/src/couchdb/couch_db_updater.erl#L346">btree_by_id_join</a> are
one such pair of extract/assemble pairs used by in couch_db_updater
for the by_id btree.
</p>



<pre class="example">
extract(#btree{extract_kv=Extract}, Value) -&gt;
    Extract(Value).

assemble(#btree{assemble_kv=Assemble}, Key, Value) -&gt;
    Assemble(Key, Value).

less(#btree{less=Less}, A, B) -&gt;
    Less(A, B).

</pre>



<p>
This version of open I believe is only used in testing
</p>


<pre class="example">% pass in 'nil' for State if a new Btree.
open(State, Fd) -&gt;
    {ok, #btree{root=State, fd=Fd}}.
</pre>





<p>
Setting the options is a typical erlang function that recursively
walks a list, updating the btree record as it goes along until the
options list is empty.
</p>



<pre class="example">
set_options(Bt, []) -&gt;
    Bt;
set_options(Bt, [{split, Extract}|Rest]) -&gt;
    set_options(Bt#btree{extract_kv=Extract}, Rest);
set_options(Bt, [{join, Assemble}|Rest]) -&gt;
    set_options(Bt#btree{assemble_kv=Assemble}, Rest);
set_options(Bt, [{less, Less}|Rest]) -&gt;
    set_options(Bt#btree{less=Less}, Rest);
set_options(Bt, [{reduce, Reduce}|Rest]) -&gt;
    set_options(Bt#btree{reduce=Reduce}, Rest);
set_options(Bt, [{compression, Comp}|Rest]) -&gt;
    set_options(Bt#btree{compression=Comp}, Rest).
</pre>





<p>
When a btree is opened, for example in <a href="https://github.com/bdionne/couchdb/blob/couch-docs/src/couchdb/couch_db_updater.erl#L441">couch_db_updater</a> a file
descriptor is passed along with a group of options. Note that in the
case of couch_db_updater, the names for the extract and assemble
functions have nothing to do with splits and joins as those names are
used in the literature. What these functions do is serialize and
deserialize the erlang records used to hold the documents. In this
case the by_id btree uses full_doc_info records and the by_seq
btree doc_info records.
</p>



<pre class="example">

open(State, Fd, Options) -&gt;
    {ok, set_options(#btree{root=State, fd=Fd}, Options)}.

get_state(#btree{root=Root}) -&gt;
    Root.

</pre>





<pre class="example">
final_reduce(#btree{reduce=Reduce}, Val) -&gt;
    final_reduce(Reduce, Val);
final_reduce(Reduce, {[], []}) -&gt;
    Reduce(reduce, []);
final_reduce(_Bt, {[], [Red]}) -&gt;
    Red;
final_reduce(Reduce, {[], Reductions}) -&gt;
    Reduce(rereduce, Reductions);
final_reduce(Reduce, {KVs, Reductions}) -&gt;
    Red = Reduce(reduce, KVs),
    final_reduce(Reduce, {[], [Red | Reductions]}).

</pre>





<pre class="example">

fold_reduce(#btree{root=Root}=Bt, Fun, Acc, Options) -&gt;
    Dir = couch_util:get_value(dir, Options, fwd),
    StartKey = couch_util:get_value(start_key, Options),
    EndKey = case couch_util:get_value(end_key_gt, Options) of
        undefined -&gt; couch_util:get_value(end_key, Options);
        LastKey -&gt; LastKey
    end,
    KeyGroupFun = couch_util:get_value(key_group_fun, Options, fun(_,_) -&gt; true end),
    {StartKey2, EndKey2} =
    case Dir of
        rev -&gt; {EndKey, StartKey};
        fwd -&gt; {StartKey, EndKey}
    end,
    try
        {ok, Acc2, GroupedRedsAcc2, GroupedKVsAcc2, GroupedKey2} =
            reduce_stream_node(Bt, Dir, Root, StartKey2, EndKey2, undefined, [], [],
            KeyGroupFun, Fun, Acc),
        if GroupedKey2 == undefined -&gt;
            {ok, Acc2};
        true -&gt;
            case Fun(GroupedKey2, {GroupedKVsAcc2, GroupedRedsAcc2}, Acc2) of
            {ok, Acc3} -&gt; {ok, Acc3};
            {stop, Acc3} -&gt; {ok, Acc3}
            end
        end
    catch
        throw:{stop, AccDone} -&gt; {ok, AccDone}
    end.

</pre>





<pre class="example">

full_reduce(#btree{root=nil,reduce=Reduce}) -&gt;
    {ok, Reduce(reduce, [])};
full_reduce(#btree{root=Root}) -&gt;
    {ok, element(2, Root)}.

</pre>





<pre class="example">
size(#btree{root = nil}) -&gt;
    0;
size(#btree{root = {_P, _Red}}) -&gt;
    % pre 1.2 format
    nil;
size(#btree{root = {_P, _Red, Size}}) -&gt;
    Size.

</pre>





<pre class="example">
% wraps a 2 arity function with the proper 3 arity function
convert_fun_arity(Fun) when is_function(Fun, 2) -&gt;
    fun
        (visit, KV, _Reds, AccIn) -&gt; Fun(KV, AccIn);
        (traverse, _K, _Red, AccIn) -&gt; {ok, AccIn}
    end;
convert_fun_arity(Fun) when is_function(Fun, 3) -&gt;
    fun
        (visit, KV, Reds, AccIn) -&gt; Fun(KV, Reds, AccIn);
        (traverse, _K, _Red, AccIn) -&gt; {ok, AccIn}
    end;
convert_fun_arity(Fun) when is_function(Fun, 4) -&gt;
    Fun.    % Already arity 4

</pre>





<pre class="example">
make_key_in_end_range_function(#btree{less=Less}, fwd, Options) -&gt;
    case couch_util:get_value(end_key_gt, Options) of
    undefined -&gt;
        case couch_util:get_value(end_key, Options) of
        undefined -&gt;
            fun(_Key) -&gt; true end;
        LastKey -&gt;
            fun(Key) -&gt; not Less(LastKey, Key) end
        end;
    EndKey -&gt;
        fun(Key) -&gt; Less(Key, EndKey) end
    end;
make_key_in_end_range_function(#btree{less=Less}, rev, Options) -&gt;
    case couch_util:get_value(end_key_gt, Options) of
    undefined -&gt;
        case couch_util:get_value(end_key, Options) of
        undefined -&gt;
            fun(_Key) -&gt; true end;
        LastKey -&gt;
            fun(Key) -&gt; not Less(Key, LastKey) end
        end;
    EndKey -&gt;
        fun(Key) -&gt; Less(EndKey, Key) end
    end.

</pre>





<pre class="example">

foldl(Bt, Fun, Acc) -&gt;
    fold(Bt, Fun, Acc, []).

foldl(Bt, Fun, Acc, Options) -&gt;
    fold(Bt, Fun, Acc, Options).


fold(#btree{root=nil}, _Fun, Acc, _Options) -&gt;
    {ok, {[], []}, Acc};
fold(#btree{root=Root}=Bt, Fun, Acc, Options) -&gt;
    Dir = couch_util:get_value(dir, Options, fwd),
    InRange = make_key_in_end_range_function(Bt, Dir, Options),
    Result =
    case couch_util:get_value(start_key, Options) of
    undefined -&gt;
        stream_node(Bt, [], Bt#btree.root, InRange, Dir,
                convert_fun_arity(Fun), Acc);
    StartKey -&gt;
        stream_node(Bt, [], Bt#btree.root, StartKey, InRange, Dir,
                convert_fun_arity(Fun), Acc)
    end,
    case Result of
    {ok, Acc2}-&gt;
        FullReduction = element(2, Root),
        {ok, {[], [FullReduction]}, Acc2};
    {stop, LastReduction, Acc2} -&gt;
        {ok, LastReduction, Acc2}
    end.

</pre>




</div>

</div>
