gh-pages/module-docs/couch_btree.html

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">Adding, deleting and looking up keys in the tree </h3>
<div class="outline-text-3" id="text-3">





<pre class="example">
add(Bt, InsertKeyValues) -&gt;
    add_remove(Bt, InsertKeyValues, []).

add_remove(Bt, InsertKeyValues, RemoveKeys) -&gt;
    {ok, [], Bt2} = query_modify(Bt, [], InsertKeyValues, RemoveKeys),
    {ok, Bt2}.

</pre>



<p>
<a name="query_modify" class="target">query_modify</a> 
</p>


<pre class="example">query_modify(Bt, LookupKeys, InsertValues, RemoveKeys) -&gt;
    #btree{root=Root} = Bt,
    InsertActions = lists:map(
        fun(KeyValue) -&gt;
            {Key, Value} = extract(Bt, KeyValue),
            {insert, Key, Value}
        end, InsertValues),
    RemoveActions = [{remove, Key, nil} || Key &lt;- RemoveKeys],
    FetchActions = [{fetch, Key, nil} || Key &lt;- LookupKeys],
    SortFun =
        fun({OpA, A, _}, {OpB, B, _}) -&gt;
            case A == B of
            % A and B are equal, sort by op.
            true -&gt; op_order(OpA) &lt; op_order(OpB);
            false -&gt;
                less(Bt, A, B)
            end
        end,
    Actions = lists:sort(SortFun, lists:append([InsertActions, RemoveActions, FetchActions])),
    {ok, KeyPointers, QueryResults} = modify_node(Bt, Root, Actions, []),
    {ok, NewRoot} = complete_root(Bt, KeyPointers),
    {ok, QueryResults, Bt#btree{root=NewRoot}}.

</pre>





<pre class="example">
% for ordering different operations with the same key.
% fetch &lt; remove &lt; insert
op_order(fetch) -&gt; 1;
op_order(remove) -&gt; 2;
op_order(insert) -&gt; 3.

</pre>





<pre class="example">
lookup(#btree{root=Root, less=Less}=Bt, Keys) -&gt;
    SortedKeys = lists:sort(Less, Keys),
    {ok, SortedResults} = lookup(Bt, Root, SortedKeys),
    % We want to return the results in the same order as the keys were input
    % but we may have changed the order when we sorted. So we need to put the
    % order back into the results.
    couch_util:reorder_results(Keys, SortedResults).

lookup(_Bt, nil, Keys) -&gt;
    {ok, [{Key, not_found} || Key &lt;- Keys]};
lookup(Bt, Node, Keys) -&gt;
    Pointer = element(1, Node),
    {NodeType, NodeList} = get_node(Bt, Pointer),
    case NodeType of
    kp_node -&gt;
        lookup_kpnode(Bt, list_to_tuple(NodeList), 1, Keys, []);
    kv_node -&gt;
        lookup_kvnode(Bt, list_to_tuple(NodeList), 1, Keys, [])
    end.

lookup_kpnode(_Bt, _NodeTuple, _LowerBound, [], Output) -&gt;
    {ok, lists:reverse(Output)};
lookup_kpnode(_Bt, NodeTuple, LowerBound, Keys, Output) when tuple_size(NodeTuple) &lt; LowerBound -&gt;
    {ok, lists:reverse(Output, [{Key, not_found} || Key &lt;- Keys])};
lookup_kpnode(Bt, NodeTuple, LowerBound, [FirstLookupKey | _] = LookupKeys, Output) -&gt;
    N = find_first_gteq(Bt, NodeTuple, LowerBound, tuple_size(NodeTuple), FirstLookupKey),
    {Key, PointerInfo} = element(N, NodeTuple),
    SplitFun = fun(LookupKey) -&gt; not less(Bt, Key, LookupKey) end,
    case lists:splitwith(SplitFun, LookupKeys) of
    {[], GreaterQueries} -&gt;
        lookup_kpnode(Bt, NodeTuple, N + 1, GreaterQueries, Output);
    {LessEqQueries, GreaterQueries} -&gt;
        {ok, Results} = lookup(Bt, PointerInfo, LessEqQueries),
        lookup_kpnode(Bt, NodeTuple, N + 1, GreaterQueries, lists:reverse(Results, Output))
    end.


lookup_kvnode(_Bt, _NodeTuple, _LowerBound, [], Output) -&gt;
    {ok, lists:reverse(Output)};
lookup_kvnode(_Bt, NodeTuple, LowerBound, Keys, Output) when tuple_size(NodeTuple) &lt; LowerBound -&gt;
    % keys not found
    {ok, lists:reverse(Output, [{Key, not_found} || Key &lt;- Keys])};
lookup_kvnode(Bt, NodeTuple, LowerBound, [LookupKey | RestLookupKeys], Output) -&gt;
    N = find_first_gteq(Bt, NodeTuple, LowerBound, tuple_size(NodeTuple), LookupKey),
    {Key, Value} = element(N, NodeTuple),
    case less(Bt, LookupKey, Key) of
    true -&gt;
        % LookupKey is less than Key
        lookup_kvnode(Bt, NodeTuple, N, RestLookupKeys, [{LookupKey, not_found} | Output]);
    false -&gt;
        case less(Bt, Key, LookupKey) of
        true -&gt;
            % LookupKey is greater than Key
            lookup_kvnode(Bt, NodeTuple, N+1, RestLookupKeys, [{LookupKey, not_found} | Output]);
        false -&gt;
            % LookupKey is equal to Key
            lookup_kvnode(Bt, NodeTuple, N, RestLookupKeys, 
                  [{LookupKey, {ok, assemble(Bt, LookupKey, Value)}} | Output])
        end
    end.

</pre>





<pre class="example">
complete_root(_Bt, []) -&gt;
    {ok, nil};
complete_root(_Bt, [{_Key, PointerInfo}])-&gt;
    {ok, PointerInfo};
complete_root(Bt, KPs) -&gt;
    {ok, ResultKeyPointers} = write_node(Bt, kp_node, KPs),
    complete_root(Bt, ResultKeyPointers).

</pre>





<pre class="example">
%%%%%%%%%%%%% The chunkify function sucks! %%%%%%%%%%%%%
% It is inaccurate as it does not account for compression when blocks are
% written. Plus with the "case byte_size(term_to_binary(InList)) of" code
% it's probably really inefficient.

chunkify(InList) -&gt;
    case ?term_size(InList) of
    Size when Size &gt; ?CHUNK_THRESHOLD -&gt;
        NumberOfChunksLikely = ((Size div ?CHUNK_THRESHOLD) + 1),
        ChunkThreshold = Size div NumberOfChunksLikely,
        chunkify(InList, ChunkThreshold, [], 0, []);
    _Else -&gt;
        [InList]
    end.

chunkify([], _ChunkThreshold, [], 0, OutputChunks) -&gt;
    lists:reverse(OutputChunks);
chunkify([], _ChunkThreshold, OutList, _OutListSize, OutputChunks) -&gt;
    lists:reverse([lists:reverse(OutList) | OutputChunks]);
chunkify([InElement | RestInList], ChunkThreshold, OutList, OutListSize, OutputChunks) -&gt;
    case ?term_size(InElement) of
    Size when (Size + OutListSize) &gt; ChunkThreshold andalso OutList /= [] -&gt;
        chunkify(RestInList, ChunkThreshold, [], 0, [lists:reverse([InElement | OutList]) | OutputChunks]);
    Size -&gt;
        chunkify(RestInList, ChunkThreshold, [InElement | OutList], OutListSize + Size, OutputChunks)
    end.

</pre>





<pre class="example">
modify_node(Bt, RootPointerInfo, Actions, QueryOutput) -&gt;
    case RootPointerInfo of
    nil -&gt;
        NodeType = kv_node,
        NodeList = [];
    _Tuple -&gt;
        Pointer = element(1, RootPointerInfo),
        {NodeType, NodeList} = get_node(Bt, Pointer)
    end,
    NodeTuple = list_to_tuple(NodeList),

    {ok, NewNodeList, QueryOutput2} =
    case NodeType of
    kp_node -&gt; modify_kpnode(Bt, NodeTuple, 1, Actions, [], QueryOutput);
    kv_node -&gt; modify_kvnode(Bt, NodeTuple, 1, Actions, [], QueryOutput)
    end,
    case NewNodeList of
    [] -&gt;  % no nodes remain
        {ok, [], QueryOutput2};
    NodeList -&gt;  % nothing changed
        {LastKey, _LastValue} = element(tuple_size(NodeTuple), NodeTuple),
        {ok, [{LastKey, RootPointerInfo}], QueryOutput2};
    _Else2 -&gt;
        {ok, ResultList} = write_node(Bt, NodeType, NewNodeList),
        {ok, ResultList, QueryOutput2}
    end.

</pre>





<pre class="example">
reduce_node(#btree{reduce=nil}, _NodeType, _NodeList) -&gt;
    [];
reduce_node(#btree{reduce=R}, kp_node, NodeList) -&gt;
    R(rereduce, [element(2, Node) || {_K, Node} &lt;- NodeList]);
reduce_node(#btree{reduce=R}=Bt, kv_node, NodeList) -&gt;
    R(reduce, [assemble(Bt, K, V) || {K, V} &lt;- NodeList]).

</pre>





<pre class="example">
reduce_tree_size(kv_node, NodeSize, _KvList) -&gt;
    NodeSize;
reduce_tree_size(kp_node, NodeSize, []) -&gt;
    NodeSize;
reduce_tree_size(kp_node, _NodeSize, [{_K, {_P, _Red}} | _]) -&gt;
    % pre 1.2 format
    nil;
reduce_tree_size(kp_node, _NodeSize, [{_K, {_P, _Red, nil}} | _]) -&gt;
    nil;
reduce_tree_size(kp_node, NodeSize, [{_K, {_P, _Red, Sz}} | NodeList]) -&gt;
    reduce_tree_size(kp_node, NodeSize + Sz, NodeList).

</pre>





<pre class="example">
get_node(#btree{fd = Fd}, NodePos) -&gt;
    {ok, {NodeType, NodeList}} = couch_file:pread_term(Fd, NodePos),
    {NodeType, NodeList}.

</pre>





<pre class="example">
write_node(#btree{fd = Fd, compression = Comp} = Bt, NodeType, NodeList) -&gt;
    % split up nodes into smaller sizes
    NodeListList = chunkify(NodeList),
    % now write out each chunk and return the KeyPointer pairs for those nodes
    ResultList = [
        begin
            {ok, Pointer, Size} = couch_file:append_term(
                Fd, {NodeType, ANodeList}, [{compression, Comp}]),
            {LastKey, _} = lists:last(ANodeList),
            SubTreeSize = reduce_tree_size(NodeType, Size, ANodeList),
            {LastKey, {Pointer, reduce_node(Bt, NodeType, ANodeList), SubTreeSize}}
        end ||
        ANodeList &lt;- NodeListList
    ],
    {ok, ResultList}.

</pre>





<pre class="example">
modify_kpnode(Bt, {}, _LowerBound, Actions, [], QueryOutput) -&gt;
    modify_node(Bt, nil, Actions, QueryOutput);
modify_kpnode(_Bt, NodeTuple, LowerBound, [], ResultNode, QueryOutput) -&gt;
    {ok, lists:reverse(ResultNode, bounded_tuple_to_list(NodeTuple, LowerBound,
            tuple_size(NodeTuple), [])), QueryOutput};
modify_kpnode(Bt, NodeTuple, LowerBound,
        [{_, FirstActionKey, _}|_]=Actions, ResultNode, QueryOutput) -&gt;
    Sz = tuple_size(NodeTuple),
    N = find_first_gteq(Bt, NodeTuple, LowerBound, Sz, FirstActionKey),
    case N =:= Sz of
    true  -&gt;
        % perform remaining actions on last node
        {_, PointerInfo} = element(Sz, NodeTuple),
        {ok, ChildKPs, QueryOutput2} =
            modify_node(Bt, PointerInfo, Actions, QueryOutput),
        NodeList = lists:reverse(ResultNode, bounded_tuple_to_list(NodeTuple, LowerBound,
            Sz - 1, ChildKPs)),
        {ok, NodeList, QueryOutput2};
    false -&gt;
        {NodeKey, PointerInfo} = element(N, NodeTuple),
        SplitFun = fun({_ActionType, ActionKey, _ActionValue}) -&gt;
                not less(Bt, NodeKey, ActionKey)
            end,
        {LessEqQueries, GreaterQueries} = lists:splitwith(SplitFun, Actions),
        {ok, ChildKPs, QueryOutput2} =
                modify_node(Bt, PointerInfo, LessEqQueries, QueryOutput),
        ResultNode2 = lists:reverse(ChildKPs, bounded_tuple_to_revlist(NodeTuple,
                LowerBound, N - 1, ResultNode)),
        modify_kpnode(Bt, NodeTuple, N+1, GreaterQueries, ResultNode2, QueryOutput2)
    end.

</pre>





<pre class="example">
bounded_tuple_to_revlist(_Tuple, Start, End, Tail) when Start &gt; End -&gt;
    Tail;
bounded_tuple_to_revlist(Tuple, Start, End, Tail) -&gt;
    bounded_tuple_to_revlist(Tuple, Start+1, End, [element(Start, Tuple)|Tail]).

bounded_tuple_to_list(Tuple, Start, End, Tail) -&gt;
    bounded_tuple_to_list2(Tuple, Start, End, [], Tail).

bounded_tuple_to_list2(_Tuple, Start, End, Acc, Tail) when Start &gt; End -&gt;
    lists:reverse(Acc, Tail);
bounded_tuple_to_list2(Tuple, Start, End, Acc, Tail) -&gt;
    bounded_tuple_to_list2(Tuple, Start + 1, End, [element(Start,
    Tuple) | Acc], Tail).

</pre>





<pre class="example">
find_first_gteq(_Bt, _Tuple, Start, End, _Key) when Start == End -&gt;
    End;
find_first_gteq(Bt, Tuple, Start, End, Key) -&gt;
    Mid = Start + ((End - Start) div 2),
    {TupleKey, _} = element(Mid, Tuple),
    case less(Bt, TupleKey, Key) of
    true -&gt;
        find_first_gteq(Bt, Tuple, Mid+1, End, Key);
    false -&gt;
        find_first_gteq(Bt, Tuple, Start, Mid, Key)
    end.

</pre>





<pre class="example">

modify_kvnode(_Bt, NodeTuple, LowerBound, [], ResultNode, QueryOutput) -&gt;
    {ok, lists:reverse(ResultNode, bounded_tuple_to_list(NodeTuple, LowerBound, tuple_size(NodeTuple), [])), QueryOutput};
modify_kvnode(Bt, NodeTuple, LowerBound, [{ActionType, ActionKey, ActionValue} | RestActions], ResultNode, QueryOutput) when LowerBound &gt; tuple_size(NodeTuple) -&gt;
    case ActionType of
    insert -&gt;
        modify_kvnode(Bt, NodeTuple, LowerBound, RestActions, [{ActionKey, ActionValue} | ResultNode], QueryOutput);
    remove -&gt;
        % just drop the action
        modify_kvnode(Bt, NodeTuple, LowerBound, RestActions, ResultNode, QueryOutput);
    fetch -&gt;
        % the key/value must not exist in the tree
        modify_kvnode(Bt, NodeTuple, LowerBound, RestActions, ResultNode, [{not_found, {ActionKey, nil}} | QueryOutput])
    end;
modify_kvnode(Bt, NodeTuple, LowerBound, [{ActionType, ActionKey, ActionValue} | RestActions], AccNode, QueryOutput) -&gt;
    N = find_first_gteq(Bt, NodeTuple, LowerBound, tuple_size(NodeTuple), ActionKey),
    {Key, Value} = element(N, NodeTuple),
    ResultNode =  bounded_tuple_to_revlist(NodeTuple, LowerBound, N - 1, AccNode),
    case less(Bt, ActionKey, Key) of
    true -&gt;
        case ActionType of
        insert -&gt;
            % ActionKey is less than the Key, so insert
            modify_kvnode(Bt, NodeTuple, N, RestActions, [{ActionKey, ActionValue} | ResultNode], QueryOutput);
        remove -&gt;
            % ActionKey is less than the Key, just drop the action
            modify_kvnode(Bt, NodeTuple, N, RestActions, ResultNode, QueryOutput);
        fetch -&gt;
            % ActionKey is less than the Key, the key/value must not exist in the tree
            modify_kvnode(Bt, NodeTuple, N, RestActions, ResultNode, [{not_found, {ActionKey, nil}} | QueryOutput])
        end;
    false -&gt;
        % ActionKey and Key are maybe equal.
        case less(Bt, Key, ActionKey) of
        false -&gt;
            case ActionType of
            insert -&gt;
                modify_kvnode(Bt, NodeTuple, N+1, RestActions, [{ActionKey, ActionValue} | ResultNode], QueryOutput);
            remove -&gt;
                modify_kvnode(Bt, NodeTuple, N+1, RestActions, ResultNode, QueryOutput);
            fetch -&gt;
                % ActionKey is equal to the Key, insert into the QueryOuput, but re-process the node
                % since an identical action key can follow it.
                modify_kvnode(Bt, NodeTuple, N, RestActions, ResultNode, [{ok, assemble(Bt, Key, Value)} | QueryOutput])
            end;
        true -&gt;
            modify_kvnode(Bt, NodeTuple, N + 1, [{ActionType, ActionKey, ActionValue} | RestActions], [{Key, Value} | ResultNode], QueryOutput)
        end
    end.

</pre>





<pre class="example">
reduce_stream_node(_Bt, _Dir, nil, _KeyStart, _KeyEnd, GroupedKey, GroupedKVsAcc,
        GroupedRedsAcc, _KeyGroupFun, _Fun, Acc) -&gt;
    {ok, Acc, GroupedRedsAcc, GroupedKVsAcc, GroupedKey};
reduce_stream_node(Bt, Dir, Node, KeyStart, KeyEnd, GroupedKey, GroupedKVsAcc,
        GroupedRedsAcc, KeyGroupFun, Fun, Acc) -&gt;
    P = element(1, Node),
    case get_node(Bt, P) of
    {kp_node, NodeList} -&gt;
        reduce_stream_kp_node(Bt, Dir, NodeList, KeyStart, KeyEnd, GroupedKey,
                GroupedKVsAcc, GroupedRedsAcc, KeyGroupFun, Fun, Acc);
    {kv_node, KVs} -&gt;
        reduce_stream_kv_node(Bt, Dir, KVs, KeyStart, KeyEnd, GroupedKey,
                GroupedKVsAcc, GroupedRedsAcc, KeyGroupFun, Fun, Acc)
    end.

reduce_stream_kv_node(Bt, Dir, KVs, KeyStart, KeyEnd,
                        GroupedKey, GroupedKVsAcc, GroupedRedsAcc,
                        KeyGroupFun, Fun, Acc) -&gt;

    GTEKeyStartKVs =
    case KeyStart of
    undefined -&gt;
        KVs;
    _ -&gt;
        lists:dropwhile(fun({Key,_}) -&gt; less(Bt, Key, KeyStart) end, KVs)
    end,
    KVs2 =
    case KeyEnd of
    undefined -&gt;
        GTEKeyStartKVs;
    _ -&gt;
        lists:takewhile(
            fun({Key,_}) -&gt;
                not less(Bt, KeyEnd, Key)
            end, GTEKeyStartKVs)
    end,
    reduce_stream_kv_node2(Bt, adjust_dir(Dir, KVs2), GroupedKey, GroupedKVsAcc, GroupedRedsAcc,
                        KeyGroupFun, Fun, Acc).


reduce_stream_kv_node2(_Bt, [], GroupedKey, GroupedKVsAcc, GroupedRedsAcc,
        _KeyGroupFun, _Fun, Acc) -&gt;
    {ok, Acc, GroupedRedsAcc, GroupedKVsAcc, GroupedKey};
reduce_stream_kv_node2(Bt, [{Key, Value}| RestKVs], GroupedKey, GroupedKVsAcc,
        GroupedRedsAcc, KeyGroupFun, Fun, Acc) -&gt;
    case GroupedKey of
    undefined -&gt;
        reduce_stream_kv_node2(Bt, RestKVs, Key,
                [assemble(Bt,Key,Value)], [], KeyGroupFun, Fun, Acc);
    _ -&gt;

        case KeyGroupFun(GroupedKey, Key) of
        true -&gt;
            reduce_stream_kv_node2(Bt, RestKVs, GroupedKey,
                [assemble(Bt,Key,Value)|GroupedKVsAcc], GroupedRedsAcc, KeyGroupFun,
                Fun, Acc);
        false -&gt;
            case Fun(GroupedKey, {GroupedKVsAcc, GroupedRedsAcc}, Acc) of
            {ok, Acc2} -&gt;
                reduce_stream_kv_node2(Bt, RestKVs, Key, [assemble(Bt,Key,Value)],
                    [], KeyGroupFun, Fun, Acc2);
            {stop, Acc2} -&gt;
                throw({stop, Acc2})
            end
        end
    end.

</pre>





<pre class="example">
reduce_stream_kp_node(Bt, Dir, NodeList, KeyStart, KeyEnd,
                        GroupedKey, GroupedKVsAcc, GroupedRedsAcc,
                        KeyGroupFun, Fun, Acc) -&gt;
    Nodes =
    case KeyStart of
    undefined -&gt;
        NodeList;
    _ -&gt;
        lists:dropwhile(
            fun({Key,_}) -&gt;
                less(Bt, Key, KeyStart)
            end, NodeList)
    end,
    NodesInRange =
    case KeyEnd of
    undefined -&gt;
        Nodes;
    _ -&gt;
        {InRange, MaybeInRange} = lists:splitwith(
            fun({Key,_}) -&gt;
                less(Bt, Key, KeyEnd)
            end, Nodes),
        InRange ++ case MaybeInRange of [] -&gt; []; [FirstMaybe|_] -&gt; [FirstMaybe] end
    end,
    reduce_stream_kp_node2(Bt, Dir, adjust_dir(Dir, NodesInRange), KeyStart, KeyEnd,
        GroupedKey, GroupedKVsAcc, GroupedRedsAcc, KeyGroupFun, Fun, Acc).


reduce_stream_kp_node2(Bt, Dir, [{_Key, NodeInfo} | RestNodeList], KeyStart, KeyEnd,
                        undefined, [], [], KeyGroupFun, Fun, Acc) -&gt;
    {ok, Acc2, GroupedRedsAcc2, GroupedKVsAcc2, GroupedKey2} =
            reduce_stream_node(Bt, Dir, NodeInfo, KeyStart, KeyEnd, undefined,
                [], [], KeyGroupFun, Fun, Acc),
    reduce_stream_kp_node2(Bt, Dir, RestNodeList, KeyStart, KeyEnd, GroupedKey2,
            GroupedKVsAcc2, GroupedRedsAcc2, KeyGroupFun, Fun, Acc2);
reduce_stream_kp_node2(Bt, Dir, NodeList, KeyStart, KeyEnd,
        GroupedKey, GroupedKVsAcc, GroupedRedsAcc, KeyGroupFun, Fun, Acc) -&gt;
    {Grouped0, Ungrouped0} = lists:splitwith(fun({Key,_}) -&gt;
        KeyGroupFun(GroupedKey, Key) end, NodeList),
    {GroupedNodes, UngroupedNodes} =
    case Grouped0 of
    [] -&gt;
        {Grouped0, Ungrouped0};
    _ -&gt;
        [FirstGrouped | RestGrouped] = lists:reverse(Grouped0),
        {RestGrouped, [FirstGrouped | Ungrouped0]}
    end,
    GroupedReds = [element(2, Node) || {_, Node} &lt;- GroupedNodes],
    case UngroupedNodes of
    [{_Key, NodeInfo}|RestNodes] -&gt;
        {ok, Acc2, GroupedRedsAcc2, GroupedKVsAcc2, GroupedKey2} =
            reduce_stream_node(Bt, Dir, NodeInfo, KeyStart, KeyEnd, GroupedKey,
                GroupedKVsAcc, GroupedReds ++ GroupedRedsAcc, KeyGroupFun, Fun, Acc),
        reduce_stream_kp_node2(Bt, Dir, RestNodes, KeyStart, KeyEnd, GroupedKey2,
                GroupedKVsAcc2, GroupedRedsAcc2, KeyGroupFun, Fun, Acc2);
    [] -&gt;
        {ok, Acc, GroupedReds ++ GroupedRedsAcc, GroupedKVsAcc, GroupedKey}
    end.
</pre>





<pre class="example">
adjust_dir(fwd, List) -&gt;
    List;
adjust_dir(rev, List) -&gt;
    lists:reverse(List).

</pre>





<pre class="example">

stream_node(Bt, Reds, Node, StartKey, InRange, Dir, Fun, Acc) -&gt;
    Pointer = element(1, Node),
    {NodeType, NodeList} = get_node(Bt, Pointer),
    case NodeType of
    kp_node -&gt;
        stream_kp_node(Bt, Reds, adjust_dir(Dir, NodeList), StartKey, InRange, Dir, Fun, Acc);
    kv_node -&gt;
        stream_kv_node(Bt, Reds, adjust_dir(Dir, NodeList), StartKey, InRange, Dir, Fun, Acc)
    end.

stream_node(Bt, Reds, Node, InRange, Dir, Fun, Acc) -&gt;
    Pointer = element(1, Node),
    {NodeType, NodeList} = get_node(Bt, Pointer),
    case NodeType of
    kp_node -&gt;
        stream_kp_node(Bt, Reds, adjust_dir(Dir, NodeList), InRange, Dir, Fun, Acc);
    kv_node -&gt;
        stream_kv_node2(Bt, Reds, [], adjust_dir(Dir, NodeList), InRange, Dir, Fun, Acc)
    end.

stream_kp_node(_Bt, _Reds, [], _InRange, _Dir, _Fun, Acc) -&gt;
    {ok, Acc};
stream_kp_node(Bt, Reds, [{Key, Node} | Rest], InRange, Dir, Fun, Acc) -&gt;
    Red = element(2, Node),
    case Fun(traverse, Key, Red, Acc) of
    {ok, Acc2} -&gt;
        case stream_node(Bt, Reds, Node, InRange, Dir, Fun, Acc2) of
        {ok, Acc3} -&gt;
            stream_kp_node(Bt, [Red | Reds], Rest, InRange, Dir, Fun, Acc3);
        {stop, LastReds, Acc3} -&gt;
            {stop, LastReds, Acc3}
        end;
    {skip, Acc2} -&gt;
        stream_kp_node(Bt, [Red | Reds], Rest, InRange, Dir, Fun, Acc2)
    end.

</pre>





<pre class="example">

drop_nodes(_Bt, Reds, _StartKey, []) -&gt;
    {Reds, []};
drop_nodes(Bt, Reds, StartKey, [{NodeKey, Node} | RestKPs]) -&gt;
    case less(Bt, NodeKey, StartKey) of
    true -&gt;
        drop_nodes(Bt, [element(2, Node) | Reds], StartKey, RestKPs);
    false -&gt;
        {Reds, [{NodeKey, Node} | RestKPs]}
    end.

</pre>





<pre class="example">

stream_kp_node(Bt, Reds, KPs, StartKey, InRange, Dir, Fun, Acc) -&gt;
    {NewReds, NodesToStream} =
    case Dir of
    fwd -&gt;
        % drop all nodes sorting before the key
        drop_nodes(Bt, Reds, StartKey, KPs);
    rev -&gt;
        % keep all nodes sorting before the key, AND the first node to sort after
        RevKPs = lists:reverse(KPs),
         case lists:splitwith(fun({Key, _Pointer}) -&gt; less(Bt, Key, StartKey) end, RevKPs) of
        {_RevsBefore, []} -&gt;
            % everything sorts before it
            {Reds, KPs};
        {RevBefore, [FirstAfter | Drop]} -&gt;
            {[element(2, Node) || {_K, Node} &lt;- Drop] ++ Reds,
                 [FirstAfter | lists:reverse(RevBefore)]}
        end
    end,
    case NodesToStream of
    [] -&gt;
        {ok, Acc};
    [{_Key, Node} | Rest] -&gt;
        case stream_node(Bt, NewReds, Node, StartKey, InRange, Dir, Fun, Acc) of
        {ok, Acc2} -&gt;
            Red = element(2, Node),
            stream_kp_node(Bt, [Red | NewReds], Rest, InRange, Dir, Fun, Acc2);
        {stop, LastReds, Acc2} -&gt;
            {stop, LastReds, Acc2}
        end
    end.
</pre>





<pre class="example">

stream_kv_node(Bt, Reds, KVs, StartKey, InRange, Dir, Fun, Acc) -&gt;
    DropFun =
    case Dir of
    fwd -&gt;
        fun({Key, _}) -&gt; less(Bt, Key, StartKey) end;
    rev -&gt;
        fun({Key, _}) -&gt; less(Bt, StartKey, Key) end
    end,
    {LTKVs, GTEKVs} = lists:splitwith(DropFun, KVs),
    AssembleLTKVs = [assemble(Bt,K,V) || {K,V} &lt;- LTKVs],
    stream_kv_node2(Bt, Reds, AssembleLTKVs, GTEKVs, InRange, Dir, Fun, Acc).

stream_kv_node2(_Bt, _Reds, _PrevKVs, [], _InRange, _Dir, _Fun, Acc) -&gt;
    {ok, Acc};
stream_kv_node2(Bt, Reds, PrevKVs, [{K,V} | RestKVs], InRange, Dir, Fun, Acc) -&gt;
    case InRange(K) of
    false -&gt;
        {stop, {PrevKVs, Reds}, Acc};
    true -&gt;
        AssembledKV = assemble(Bt, K, V),
        case Fun(visit, AssembledKV, {PrevKVs, Reds}, Acc) of
        {ok, Acc2} -&gt;
            stream_kv_node2(Bt, Reds, [AssembledKV | PrevKVs], RestKVs, InRange, Dir, Fun, Acc2);
        {stop, Acc2} -&gt;
            {stop, {PrevKVs, Reds}, Acc2}
        end
    end.
</pre>



</div>
</div>
<div id="postamble">
<p class="author"> Author: Robert Dionne
<a href="mailto:bitdiddle@apache.org">&lt;bitdiddle@apache.org&gt;</a>
</p>
<p class="date"> Date: 2011-12-19 Mon</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
